{"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_26", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_26"}, "inbound_nodes": []}, {"name": "lambda_26", "class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000d\u0001\u001b\u0000S\u0000)\u0002N\u00e9\u00ff\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa+/home/chriskjou/ml/cellimaging/tfkeras4b.py\u00da\b<lambda>?\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"name": "conv2d_476", "class_name": "Conv2D", "config": {"name": "conv2d_476", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_26", 0, 0, {}]]]}, {"name": "dropout_226", "class_name": "Dropout", "config": {"name": "dropout_226", "trainable": true, "rate": 0.1}, "inbound_nodes": [[["conv2d_476", 0, 0, {}]]]}, {"name": "conv2d_477", "class_name": "Conv2D", "config": {"name": "conv2d_477", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_226", 0, 0, {}]]]}, {"name": "max_pooling2d_101", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_101", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_477", 0, 0, {}]]]}, {"name": "conv2d_478", "class_name": "Conv2D", "config": {"name": "conv2d_478", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_101", 0, 0, {}]]]}, {"name": "dropout_227", "class_name": "Dropout", "config": {"name": "dropout_227", "trainable": true, "rate": 0.1}, "inbound_nodes": [[["conv2d_478", 0, 0, {}]]]}, {"name": "conv2d_479", "class_name": "Conv2D", "config": {"name": "conv2d_479", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_227", 0, 0, {}]]]}, {"name": "max_pooling2d_102", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_102", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_479", 0, 0, {}]]]}, {"name": "conv2d_480", "class_name": "Conv2D", "config": {"name": "conv2d_480", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_102", 0, 0, {}]]]}, {"name": "dropout_228", "class_name": "Dropout", "config": {"name": "dropout_228", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_480", 0, 0, {}]]]}, {"name": "conv2d_481", "class_name": "Conv2D", "config": {"name": "conv2d_481", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_228", 0, 0, {}]]]}, {"name": "max_pooling2d_103", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_103", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_481", 0, 0, {}]]]}, {"name": "conv2d_482", "class_name": "Conv2D", "config": {"name": "conv2d_482", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_103", 0, 0, {}]]]}, {"name": "dropout_229", "class_name": "Dropout", "config": {"name": "dropout_229", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_482", 0, 0, {}]]]}, {"name": "conv2d_483", "class_name": "Conv2D", "config": {"name": "conv2d_483", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_229", 0, 0, {}]]]}, {"name": "max_pooling2d_104", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_104", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_483", 0, 0, {}]]]}, {"name": "conv2d_484", "class_name": "Conv2D", "config": {"name": "conv2d_484", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_104", 0, 0, {}]]]}, {"name": "dropout_230", "class_name": "Dropout", "config": {"name": "dropout_230", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["conv2d_484", 0, 0, {}]]]}, {"name": "conv2d_485", "class_name": "Conv2D", "config": {"name": "conv2d_485", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_230", 0, 0, {}]]]}, {"name": "conv2d_transpose_101", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_101", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_485", 0, 0, {}]]]}, {"name": "concatenate_101", "class_name": "Concatenate", "config": {"name": "concatenate_101", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_101", 0, 0, {}], ["conv2d_483", 0, 0, {}]]]}, {"name": "conv2d_486", "class_name": "Conv2D", "config": {"name": "conv2d_486", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_101", 0, 0, {}]]]}, {"name": "dropout_231", "class_name": "Dropout", "config": {"name": "dropout_231", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_486", 0, 0, {}]]]}, {"name": "conv2d_487", "class_name": "Conv2D", "config": {"name": "conv2d_487", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_231", 0, 0, {}]]]}, {"name": "conv2d_transpose_102", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_102", "trainable": true, "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_487", 0, 0, {}]]]}, {"name": "concatenate_102", "class_name": "Concatenate", "config": {"name": "concatenate_102", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_102", 0, 0, {}], ["conv2d_481", 0, 0, {}]]]}, {"name": "conv2d_488", "class_name": "Conv2D", "config": {"name": "conv2d_488", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_102", 0, 0, {}]]]}, {"name": "dropout_232", "class_name": "Dropout", "config": {"name": "dropout_232", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_488", 0, 0, {}]]]}, {"name": "conv2d_489", "class_name": "Conv2D", "config": {"name": "conv2d_489", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_232", 0, 0, {}]]]}, {"name": "conv2d_transpose_103", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_103", "trainable": true, "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_489", 0, 0, {}]]]}, {"name": "concatenate_103", "class_name": "Concatenate", "config": {"name": "concatenate_103", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_103", 0, 0, {}], ["conv2d_479", 0, 0, {}]]]}, {"name": "conv2d_490", "class_name": "Conv2D", "config": {"name": "conv2d_490", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_103", 0, 0, {}]]]}, {"name": "dropout_233", "class_name": "Dropout", "config": {"name": "dropout_233", "trainable": true, "rate": 0.1}, "inbound_nodes": [[["conv2d_490", 0, 0, {}]]]}, {"name": "conv2d_491", "class_name": "Conv2D", "config": {"name": "conv2d_491", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_233", 0, 0, {}]]]}, {"name": "conv2d_transpose_104", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_104", "trainable": true, "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_491", 0, 0, {}]]]}, {"name": "concatenate_104", "class_name": "Concatenate", "config": {"name": "concatenate_104", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_transpose_104", 0, 0, {}], ["conv2d_477", 0, 0, {}]]]}, {"name": "conv2d_492", "class_name": "Conv2D", "config": {"name": "conv2d_492", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_104", 0, 0, {}]]]}, {"name": "dropout_234", "class_name": "Dropout", "config": {"name": "dropout_234", "trainable": true, "rate": 0.1}, "inbound_nodes": [[["conv2d_492", 0, 0, {}]]]}, {"name": "conv2d_493", "class_name": "Conv2D", "config": {"name": "conv2d_493", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_234", 0, 0, {}]]]}, {"name": "conv2d_494", "class_name": "Conv2D", "config": {"name": "conv2d_494", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_493", 0, 0, {}]]]}], "input_layers": [["input_26", 0, 0]], "output_layers": [["conv2d_494", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}