{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_23", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_23"}, "inbound_nodes": []}, {"name": "lambda_23", "class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\b\u0000\u0000\u0000|\u0000d\u0001\u001b\u0000S\u0000)\u0002N\u00e9\u00ff\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa+/home/chriskjou/ml/cellimaging/tfkeras4b.py\u00da\b<lambda>?\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["input_23", 0, 0, {}]]]}, {"name": "conv2d_419", "class_name": "Conv2D", "config": {"name": "conv2d_419", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_23", 0, 0, {}]]]}, {"name": "dropout_199", "class_name": "Dropout", "config": {"name": "dropout_199", "trainable": true, "rate": 0.1}, "inbound_nodes": [[["conv2d_419", 0, 0, {}]]]}, {"name": "conv2d_420", "class_name": "Conv2D", "config": {"name": "conv2d_420", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_199", 0, 0, {}]]]}, {"name": "max_pooling2d_89", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_89", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_420", 0, 0, {}]]]}, {"name": "conv2d_421", "class_name": "Conv2D", "config": {"name": "conv2d_421", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_89", 0, 0, {}]]]}, {"name": "dropout_200", "class_name": "Dropout", "config": {"name": "dropout_200", "trainable": true, "rate": 0.1}, "inbound_nodes": [[["conv2d_421", 0, 0, {}]]]}, {"name": "conv2d_422", "class_name": "Conv2D", "config": {"name": "conv2d_422", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_200", 0, 0, {}]]]}, {"name": "max_pooling2d_90", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_90", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_422", 0, 0, {}]]]}, {"name": "conv2d_423", "class_name": "Conv2D", "config": {"name": "conv2d_423", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_90", 0, 0, {}]]]}, {"name": "dropout_201", "class_name": "Dropout", "config": {"name": "dropout_201", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_423", 0, 0, {}]]]}, {"name": "conv2d_424", "class_name": "Conv2D", "config": {"name": "conv2d_424", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_201", 0, 0, {}]]]}, {"name": "max_pooling2d_91", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_91", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_424", 0, 0, {}]]]}, {"name": "conv2d_425", "class_name": "Conv2D", "config": {"name": "conv2d_425", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_91", 0, 0, {}]]]}, {"name": "dropout_202", "class_name": "Dropout", "config": {"name": "dropout_202", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_425", 0, 0, {}]]]}, {"name": "conv2d_426", "class_name": "Conv2D", "config": {"name": "conv2d_426", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_202", 0, 0, {}]]]}, {"name": "max_pooling2d_92", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_92", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_426", 0, 0, {}]]]}, {"name": "conv2d_427", "class_name": "Conv2D", "config": {"name": "conv2d_427", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_92", 0, 0, {}]]]}, {"name": "dropout_203", "class_name": "Dropout", "config": {"name": "dropout_203", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["conv2d_427", 0, 0, {}]]]}, {"name": "conv2d_428", "class_name": "Conv2D", "config": {"name": "conv2d_428", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_203", 0, 0, {}]]]}, {"name": "conv2d_transpose_89", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_89", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_428", 0, 0, {}]]]}, {"name": "concatenate_89", "class_name": "Concatenate", "config": {"name": "concatenate_89", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_89", 0, 0, {}], ["conv2d_426", 0, 0, {}]]]}, {"name": "conv2d_429", "class_name": "Conv2D", "config": {"name": "conv2d_429", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_89", 0, 0, {}]]]}, {"name": "dropout_204", "class_name": "Dropout", "config": {"name": "dropout_204", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_429", 0, 0, {}]]]}, {"name": "conv2d_430", "class_name": "Conv2D", "config": {"name": "conv2d_430", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_204", 0, 0, {}]]]}, {"name": "conv2d_transpose_90", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_90", "trainable": true, "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_430", 0, 0, {}]]]}, {"name": "concatenate_90", "class_name": "Concatenate", "config": {"name": "concatenate_90", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_90", 0, 0, {}], ["conv2d_424", 0, 0, {}]]]}, {"name": "conv2d_431", "class_name": "Conv2D", "config": {"name": "conv2d_431", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_90", 0, 0, {}]]]}, {"name": "dropout_205", "class_name": "Dropout", "config": {"name": "dropout_205", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["conv2d_431", 0, 0, {}]]]}, {"name": "conv2d_432", "class_name": "Conv2D", "config": {"name": "conv2d_432", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_205", 0, 0, {}]]]}, {"name": "conv2d_transpose_91", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_91", "trainable": true, "filters": 32, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_432", 0, 0, {}]]]}, {"name": "concatenate_91", "class_name": "Concatenate", "config": {"name": "concatenate_91", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv2d_transpose_91", 0, 0, {}], ["conv2d_422", 0, 0, {}]]]}, {"name": "conv2d_433", "class_name": "Conv2D", "config": {"name": "conv2d_433", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_91", 0, 0, {}]]]}, {"name": "dropout_206", "class_name": "Dropout", "config": {"name": "dropout_206", "trainable": true, "rate": 0.1}, "inbound_nodes": [[["conv2d_433", 0, 0, {}]]]}, {"name": "conv2d_434", "class_name": "Conv2D", "config": {"name": "conv2d_434", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_206", 0, 0, {}]]]}, {"name": "conv2d_transpose_92", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_92", "trainable": true, "filters": 16, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_434", 0, 0, {}]]]}, {"name": "concatenate_92", "class_name": "Concatenate", "config": {"name": "concatenate_92", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_transpose_92", 0, 0, {}], ["conv2d_420", 0, 0, {}]]]}, {"name": "conv2d_435", "class_name": "Conv2D", "config": {"name": "conv2d_435", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_92", 0, 0, {}]]]}, {"name": "dropout_207", "class_name": "Dropout", "config": {"name": "dropout_207", "trainable": true, "rate": 0.1}, "inbound_nodes": [[["conv2d_435", 0, 0, {}]]]}, {"name": "conv2d_436", "class_name": "Conv2D", "config": {"name": "conv2d_436", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_207", 0, 0, {}]]]}, {"name": "conv2d_437", "class_name": "Conv2D", "config": {"name": "conv2d_437", "trainable": true, "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_436", 0, 0, {}]]]}], "input_layers": [["input_23", 0, 0]], "output_layers": [["conv2d_437", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}